INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('193dc7d2-e709-7d02-b7b5-433248c96ffa','input-password','InputPassword','views/model/Components/InputPassword',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'密码输入框',NULL,false,false,false,false,false,NULL,false,false,15,1,'2024-05-09 15:58:07.082877','2024-05-24 21:17:09.866391'),
	 ('f69fb94e-711a-039a-dd74-2590b7cf734d','menu1-2','Menu12','views/model/Level/Menu12',NULL,'024e02e8-1c84-044a-177e-3b6cca889fe5',1,'菜单1-2',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 16:21:00.132864','2024-05-24 21:20:02.581981'),
	 ('14d4cab6-f978-6847-8388-24aa9ab5eac3','workplace','Workplace','views/Dashboard/Workplace',NULL,'c420e68a-c8cd-04db-b707-9fb4584d1854',0,'你猜',NULL,false,false,false,false,false,NULL,true,false,1,1,'2024-04-29 21:46:51.84204','2024-06-05 20:18:47.073828'),
	 ('3d391027-6994-6558-3c0b-5e44b71e649f','menu','Menu','views/Authorization/Menu/Menu',NULL,'07c31770-d439-daa2-9a04-5c309ad99e5b',1,'菜单',NULL,false,false,false,false,false,NULL,true,false,3,1,'2024-04-29 21:46:51.84204','2024-05-24 21:13:09.693992'),
	 ('a36613e5-e249-41a5-9ee6-edc6524c648e','components','ComponentsDemo','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'组件',NULL,true,false,false,false,false,NULL,false,false,1,0,'2024-05-08 21:07:20.879543','2024-05-24 21:14:05.426941'),
	 ('dadcc7c9-f59f-ff94-4f5b-e8b36030210d','editor-demo','EditorDemo','##',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'编辑器',NULL,true,false,false,false,false,NULL,false,false,3,0,'2024-05-09 14:58:31.755435','2024-05-24 21:14:43.662737'),
	 ('c80058e6-7aed-54a3-86ce-820401904189','search','Search','views/model/Components/Search',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'查询',NULL,false,false,false,false,false,NULL,false,false,4,1,'2024-05-09 15:01:52.75091','2024-05-24 21:14:56.983335'),
	 ('e0a2b76e-c799-ba36-2031-5c55c3ebaa24','editor','Editor','views/model/Components/Editor/Editor',NULL,'dadcc7c9-f59f-ff94-4f5b-e8b36030210d',1,'富文本编辑器',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-09 14:59:27.007152','2024-05-24 21:16:00.028546'),
	 ('9a006e12-7026-ce3f-5cf3-e55004622617','json-editor','JsonEditor','views/model/Components/Editor/JsonEditor',NULL,'dadcc7c9-f59f-ff94-4f5b-e8b36030210d',1,'JSON编辑器',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 15:00:10.411828','2024-05-24 21:16:08.301309'),
	 ('8d4dc48c-a0ff-4be3-7cf1-35f9a62b0ea2','descriptions','Descriptions','views/model/Components/Descriptions',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'描述',NULL,false,false,false,false,false,NULL,false,false,5,1,'2024-05-09 15:42:53.186449','2024-05-24 21:16:13.480766');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('509e2847-3b91-2bb1-2c40-2df953d6a2fc','image-viewer','ImageViewer','views/model/Components/ImageViewer',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'图片预览',NULL,false,false,false,false,false,NULL,false,false,6,1,'2024-05-09 15:43:46.029713','2024-05-24 21:16:19.030464'),
	 ('ed8cecd7-d4d5-df99-4699-10fe9a9a59aa','dialog','Dialog','views/model/Components/Dialog',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'弹窗',NULL,false,false,false,false,false,NULL,false,false,7,1,'2024-05-09 15:44:19.553161','2024-05-24 21:16:25.990576'),
	 ('e25b497e-7317-8bea-6f96-cb4e8ad3f6be','icon','Icon','views/model/Components/Icon',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'图标',NULL,false,false,false,false,false,NULL,false,false,8,1,'2024-05-09 15:44:57.531423','2024-05-24 21:16:31.752815'),
	 ('f2774912-26c4-9cf9-f1ef-ff22ef60f485','icon-picker','IconPicker','views/model/Components/IconPicker',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'图标选择器',NULL,false,false,false,false,false,NULL,false,false,9,1,'2024-05-09 15:46:12.634391','2024-05-24 21:16:36.803122'),
	 ('c1655858-a655-287b-89f0-b85cc86ab900','echart','Echart','views/model/Components/Echart',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'图表',NULL,false,false,false,false,false,NULL,false,false,10,1,'2024-05-09 15:48:46.541315','2024-05-24 21:16:42.130509'),
	 ('a8a12552-3d02-f879-166d-4f1f60b749a2','user','User','views/Authorization/User/User',NULL,'07c31770-d439-daa2-9a04-5c309ad99e5b',1,'用户',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-24 23:07:18.325997','2024-05-25 13:45:56.71747'),
	 ('6dfa90cf-7654-9714-27aa-ad5e7d99b6c5','userManagement','UserManagement1','views/UserManagement/UserManagement',NULL,'b7d4fd1d-dd45-7aa4-9204-944a6e3bcff7',1,'用户管理',NULL,false,false,false,false,false,NULL,false,false,0,1,'2024-06-05 20:16:16.179805',NULL),
	 ('b7d4fd1d-dd45-7aa4-9204-944a6e3bcff7','/userManagement','UserManagement','#',NULL,NULL,1,'',NULL,false,false,false,false,false,NULL,false,false,5,0,'2024-06-05 20:12:30.99685',NULL),
	 ('07c31770-d439-daa2-9a04-5c309ad99e5b','/authorization','Authorization','#',NULL,NULL,1,'权限管理',NULL,true,false,false,false,false,NULL,true,false,200,0,'2024-04-29 21:46:51.84204','2024-05-24 15:26:37.363114'),
	 ('0fadbea2-0c0a-24ad-3d47-010a264e6cf6','/model','Model','#','/model/components/form/default-form',NULL,1,'案例',NULL,true,false,false,false,false,NULL,false,false,300,0,'2024-05-08 21:06:13.292083','2024-05-24 17:42:08.950514');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('c420e68a-c8cd-04db-b707-9fb4584d1854','/dashboard','Dashboard','#','/dashboard/analysis',NULL,1,'首页','ant-design:dashboard-filled',true,false,false,false,true,NULL,true,false,1,0,'2024-04-29 21:46:51.84204','2024-05-10 09:27:59.128653'),
	 ('9551e08c-d0d4-135b-0a26-94ad33fcaf6f','form','Form','##',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'表单',NULL,true,false,false,false,false,NULL,false,false,1,0,'2024-05-08 21:09:05.291696','2024-05-24 21:14:14.083384'),
	 ('7e48e089-324d-7783-eb8d-1b924a73cc42','default-form','DefaultForm','views/model/Components/Form/DefaultForm',NULL,'9551e08c-d0d4-135b-0a26-94ad33fcaf6f',1,'全部示例',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-08 21:15:37.921592','2024-05-24 21:14:20.466088'),
	 ('3b6dfe6e-b612-af66-87d0-dc1e3853d3f3','use-form','UseForm','views/model/Components/Form/UseFormDemo',NULL,'9551e08c-d0d4-135b-0a26-94ad33fcaf6f',1,'UseForm',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-08 21:44:31.773065','2024-05-24 21:14:26.618402'),
	 ('0d151fbb-0817-daf2-fc6d-c019c005e950','table','TableDemo','##',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'表格',NULL,true,false,false,false,false,NULL,false,false,2,0,'2024-05-08 21:46:17.378042','2024-05-24 21:14:35.818234'),
	 ('11f4d952-7242-2070-f064-81538697d8b9','default-table','DefaultTable','views/model/Components/Table/DefaultTable',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'基础示例',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-08 21:47:23.690391','2024-05-24 21:15:10.129579'),
	 ('93b87065-8fe0-2847-3298-2ab5ffa6d79d','use-table','UseTable','views/model/Components/Table/UseTableDemo',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'UseTable',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-08 21:48:15.907309','2024-05-24 21:15:14.388619'),
	 ('d15d17e7-00f6-6c8e-c087-b7546c2f725f','tree-table','TreeTable','views/model/Components/Table/TreeTable',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'TreeTable',NULL,false,false,false,false,false,NULL,false,false,3,1,'2024-05-08 21:49:01.693737','2024-05-24 21:15:19.245155'),
	 ('1f7d2ce7-b29c-9811-ede8-d7050783f701','table-image-preview','TableImagePreview','views/model/Components/Table/TableImagePreview',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'表格图片预览',NULL,false,false,false,false,false,NULL,false,false,4,1,'2024-05-08 21:49:40.966629','2024-05-24 21:15:24.31687'),
	 ('ea57eabe-9c38-f339-ad54-fbf63b4d3708','table-video-preview','TableVideoPreview','views/model/Components/Table/TableVideoPreview',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'表格视频预览',NULL,false,false,false,false,false,NULL,false,false,5,1,'2024-05-08 21:50:16.945828','2024-05-24 21:15:28.827883');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('6892e7af-fbb8-e66d-043e-5f55588929a0','card-table','CardTable','views/model/Components/Table/CardTable',NULL,'0d151fbb-0817-daf2-fc6d-c019c005e950',1,'卡片表格',NULL,false,false,false,false,false,NULL,false,false,6,1,'2024-05-08 21:50:49.423525','2024-05-24 21:15:36.288569'),
	 ('601646df-5f51-2edc-3eba-7c4a245a0994','count-to','CountTo','views/model/Components/CountTo',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'数字动画',NULL,false,false,false,false,false,NULL,false,false,11,1,'2024-05-09 15:51:34.232096','2024-05-24 21:16:46.474945'),
	 ('e145752b-4c79-64ed-d43d-96fb6b7da8f9','qrcode','Qrcode','views/model/Components/Qrcode',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'二维码',NULL,false,false,false,false,false,NULL,false,false,12,1,'2024-05-09 15:52:10.834426','2024-05-24 21:16:51.249875'),
	 ('df627837-6337-626b-4666-a2e6b6ae097c','highlight','Highlight','views/model/Components/Highlight',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'高亮',NULL,false,false,false,false,false,NULL,false,false,13,1,'2024-05-09 15:55:16.3542','2024-05-24 21:16:56.064528'),
	 ('2e155900-2e85-b56d-45f6-7b5e7164e251','infotip','Infotip','views/model/Components/Infotip',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'信息提示',NULL,false,false,false,false,false,NULL,false,false,14,1,'2024-05-09 15:55:52.006229','2024-05-24 21:17:04.861698'),
	 ('79f45761-e249-2a4b-61b4-f8e0d0922779','waterfall','Waterfall','views/model/Components/Waterfall',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'瀑布流',NULL,false,false,false,false,false,NULL,false,false,16,1,'2024-05-09 15:58:38.312942','2024-05-24 21:17:14.993424'),
	 ('fcaade0d-38b0-477e-da11-b2724b854325','image-cropping','ImageCropping','views/model/Components/ImageCropping',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'图片裁剪',NULL,false,false,false,false,false,NULL,false,false,17,1,'2024-05-09 15:59:13.299665','2024-05-24 21:17:20.830238'),
	 ('7dcdcf89-9e75-2fd1-0ece-4b04a60aae9e','video-player','VideoPlayer','views/model/Components/VideoPlayer',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'视频播放器',NULL,false,false,false,false,false,NULL,false,false,18,1,'2024-05-09 15:59:45.537174','2024-05-24 21:17:25.930722'),
	 ('4af54d8f-b41a-286e-1e0d-046a95d0f248','avatars','Avatars','views/model/Components/Avatars',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'头像列表',NULL,false,false,false,false,false,NULL,false,false,19,1,'2024-05-09 16:00:21.033128','2024-05-24 21:17:32.714115'),
	 ('7099562c-2112-7464-abc6-8a6a9033ec43','i-agree','IAgree','views/model/Components/IAgree',NULL,'a36613e5-e249-41a5-9ee6-edc6524c648e',1,'我同意',NULL,false,false,false,false,false,NULL,false,false,20,1,'2024-05-09 16:00:52.19633','2024-05-24 21:17:39.350058');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('eb8cd725-09f1-9992-aabf-1a7f6b4cc5c9','function','Function','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'功能','ri:function-fill',true,false,false,false,false,NULL,false,false,2,0,'2024-05-09 16:03:06.054326','2024-05-24 21:18:10.631137'),
	 ('1a4e1118-ef7b-37e4-78f0-84129f6d8971','hooks','Hooks','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'hooks','ic:outline-webhook',true,false,false,false,false,NULL,false,false,3,0,'2024-05-09 16:09:29.293371','2024-05-24 21:18:24.754616'),
	 ('c223bbdf-095b-d133-8c6e-7cfb9adc9335','level','Level','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'多级菜单','carbon:skill-level-advanced',true,false,false,false,false,NULL,false,false,4,0,'2024-05-09 16:16:59.96367','2024-05-24 21:18:32.250981'),
	 ('b2efc652-e412-94d5-ca2e-50ec90ac0023','multipleTabs','MultipleTabs','views/model/Function/MultipleTabs',NULL,'eb8cd725-09f1-9992-aabf-1a7f6b4cc5c9',1,'多开标签页',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-09 16:03:45.1763','2024-05-24 21:18:49.973917'),
	 ('b387dc45-f6ff-0df8-4e3c-54dda0a535b1','multiple-tabs-demo/:id','MultipleTabsDemo','views/model/Function/MultipleTabsDemo',NULL,'eb8cd725-09f1-9992-aabf-1a7f6b4cc5c9',1,'详情页',NULL,false,false,false,true,true,NULL,false,false,2,1,'2024-05-09 16:07:13.79171','2024-05-24 21:18:54.03871'),
	 ('52b07001-d572-1a51-e4bc-e8cb14f0168f','request','Request','views/model/Function/Request',NULL,'eb8cd725-09f1-9992-aabf-1a7f6b4cc5c9',0,'请求',NULL,false,false,false,false,false,NULL,false,false,3,1,'2024-05-09 16:07:46.655467','2024-05-24 21:18:58.987194'),
	 ('1d2fae42-de04-97a2-2a29-94a01017b6ea','test','Test','views/model/Function/Test',NULL,'eb8cd725-09f1-9992-aabf-1a7f6b4cc5c9',1,'权限测试页',NULL,false,false,false,false,false,NULL,false,false,4,1,'2024-05-09 16:08:20.810648','2024-05-24 21:19:03.55835'),
	 ('9a10db0e-da42-318e-2833-fc7d8da991bd','useWatermark','UseWatermark','views/model/hooks/useWatermark',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useWatermark',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-09 16:10:07.777818','2024-05-24 21:19:09.677229'),
	 ('c444d5f1-83d8-764b-c0ec-ff6d435d6b28','useTagsView','UseTagsView','views/model/hooks/useTagsView',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useTagsView',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 16:14:29.829083','2024-05-24 21:19:13.778066'),
	 ('d0e78c9f-6224-198f-a92c-f5579ae1ce7b','useValidator','UseValidator','views/model/hooks/useValidator',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useValidator',NULL,false,false,false,false,false,NULL,false,false,3,1,'2024-05-09 16:15:00.375577','2024-05-24 21:19:19.018746');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('35917f3b-d431-ad39-5968-c0bc2a8c884d','useCrudSchemas','UseCrudSchemas','views/model/hooks/useCrudSchemas',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useCrudSchemas',NULL,false,false,false,false,false,NULL,false,false,4,1,'2024-05-09 16:15:24.61613','2024-05-24 21:19:24.753927'),
	 ('5c1b6bb2-5dfd-7b81-8f76-7a9e07125135','useClipboard','UseClipboard','views/model/hooks/useClipboard',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useClipboard',NULL,false,false,false,false,false,NULL,false,false,5,1,'2024-05-09 16:15:51.594713','2024-05-24 21:19:29.223266'),
	 ('b6a29ae7-d1cc-7414-f53d-eb2a3a3f0a09','useNetwork','UseNetwork','views/model/hooks/useNetwork',NULL,'1a4e1118-ef7b-37e4-78f0-84129f6d8971',1,'useNetwork',NULL,false,false,false,false,false,NULL,false,false,6,1,'2024-05-09 16:16:16.81775','2024-05-24 21:19:33.623766'),
	 ('024e02e8-1c84-044a-177e-3b6cca889fe5','menu1','Menu1','##',NULL,'c223bbdf-095b-d133-8c6e-7cfb9adc9335',1,'菜单1',NULL,true,false,false,false,false,NULL,false,false,1,0,'2024-05-09 16:17:41.108904','2024-05-24 21:19:43.028318'),
	 ('9d16de49-e370-74d1-9425-aa58731a931d','menu1-1','Menu11','##',NULL,'024e02e8-1c84-044a-177e-3b6cca889fe5',1,'菜单1-1',NULL,true,false,false,false,false,NULL,false,false,1,0,'2024-05-09 16:19:45.936514','2024-05-24 21:19:55.014244'),
	 ('4d58ec8f-2c2d-63f0-af26-7eede454a6ad','menu1-1-1','Menu111','views/model/Level/Menu111',NULL,'9d16de49-e370-74d1-9425-aa58731a931d',1,'菜单1-1-1',NULL,false,false,false,true,false,NULL,false,false,1,1,'2024-05-09 16:20:19.211794','2024-05-24 21:20:07.28725'),
	 ('d621c508-5d12-3948-5aaf-4007333192f2','analysis','Analysis','views/Dashboard/Analysis',NULL,'c420e68a-c8cd-04db-b707-9fb4584d1854',1,'首页',NULL,false,false,false,false,false,NULL,true,false,2,1,'2024-04-29 21:46:51.84204','2024-06-04 20:43:30.22297'),
	 ('12fe890a-2c94-fe11-70df-021fd9172fca','role','Role','views/Authorization/Role/Role',NULL,'07c31770-d439-daa2-9a04-5c309ad99e5b',1,'角色',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-21 15:42:51.265449','2024-05-24 21:13:23.061503'),
	 ('e393ad39-117f-9a1c-3bdf-ac83ddfc46b9','example','Example','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'综合示例','ep:management',true,false,false,false,false,NULL,false,false,5,0,'2024-05-09 16:26:44.912268','2024-05-24 21:18:38.955269'),
	 ('3a8c3670-a360-3b72-7e49-9bd5097a06c3','menu2','Menu2Demo','views/model/Level/Menu2',NULL,'c223bbdf-095b-d133-8c6e-7cfb9adc9335',1,'菜单2',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 16:21:38.571008','2024-05-24 21:19:47.946791');
INSERT INTO menus (id,"path","name",component,redirect,parent_id,status,title,icon,always_show,affix,no_cache,hidden,can_to,active_menu,breadcrumb,no_tags_view,sort,"type",create_time,update_time) VALUES
	 ('bb6523f5-08cb-177f-598a-56f411822d5c','example-dialog','ExampleDialog','views/model/Example/Dialog/ExampleDialog',NULL,'e393ad39-117f-9a1c-3bdf-ac83ddfc46b9',1,'综合示例 - 弹窗',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-09 16:29:37.485566','2024-05-24 21:20:12.192623'),
	 ('5942cf14-9872-b444-b79c-0e0e42c81581','example-page','ExamplePage','views/model/Example/Page/ExamplePage',NULL,'e393ad39-117f-9a1c-3bdf-ac83ddfc46b9',1,'综合示例 - 页面',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 16:30:24.261827','2024-05-24 21:20:16.110282'),
	 ('1b2ac5f2-f1db-3247-5f93-3f918be4a2ea','example-add','ExampleAdd','views/model/Example/Page/ExampleAdd',NULL,'e393ad39-117f-9a1c-3bdf-ac83ddfc46b9',1,'综合示例 - 新增',NULL,false,false,false,false,false,NULL,false,false,3,1,'2024-05-09 16:31:03.857986','2024-05-24 21:20:20.284781'),
	 ('20d7d35f-b45f-0cb6-058d-595f595e7c8b','example-edit','ExampleEdit','views/model/Example/Page/ExampleEdit',NULL,'e393ad39-117f-9a1c-3bdf-ac83ddfc46b9',1,'综合示例 - 编辑',NULL,false,false,false,false,false,NULL,false,false,4,1,'2024-05-09 16:32:52.387704','2024-05-24 21:20:24.357762'),
	 ('7aa95cde-eead-cd1d-f921-4f55d9c4f387','example-detail','ExampleDetail','views/model/Example/Page/ExampleDetail',NULL,'e393ad39-117f-9a1c-3bdf-ac83ddfc46b9',1,'综合示例 - 详情',NULL,false,false,false,false,false,NULL,false,false,5,1,'2024-05-09 16:38:27.809013','2024-05-24 21:20:28.538316'),
	 ('7a6ecb58-1031-b330-7f43-7819741a74ba','error','Error','##',NULL,'0fadbea2-0c0a-24ad-3d47-010a264e6cf6',1,'错误页面','ci:error',true,false,false,false,false,NULL,false,false,6,0,'2024-05-09 16:39:10.838692','2024-05-24 21:20:36.948387'),
	 ('69b609bb-f109-ee38-a2cc-30c5b3e4956e','404-demo','404Demo','views/Error/404',NULL,'7a6ecb58-1031-b330-7f43-7819741a74ba',1,'404',NULL,false,false,false,false,false,NULL,false,false,1,1,'2024-05-09 16:40:27.044979','2024-05-24 21:20:41.128793'),
	 ('51caef43-8bc5-1ef2-259e-673f592767df','403-demo','403Demo','views/Error/403',NULL,'7a6ecb58-1031-b330-7f43-7819741a74ba',1,'403',NULL,false,false,false,false,false,NULL,false,false,2,1,'2024-05-09 16:40:52.575872','2024-05-24 21:20:45.147233'),
	 ('a0935db7-0b8e-c9fb-fa71-de0de1c933bc','500-demo','500Demo','views/Error/500',NULL,'7a6ecb58-1031-b330-7f43-7819741a74ba',1,'500',NULL,false,false,false,false,false,NULL,false,false,3,1,'2024-05-09 16:41:18.037139','2024-05-24 21:20:48.665547');

INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002039','1000101','田贝营销服务中心（其他）',5),
	 ('940262055','1000102','保税区营销服务中心（其他）',5),
	 ('1002049','1000102','梅林营销服务中心（其他）',5),
	 ('1002048','1000102','皇岗营销服务中心（其他）',5),
	 ('1002046','1000102','黄木岗营销服务中心（其他）',5),
	 ('1002052','1000102','沙尾营销服务中心（其他）',5),
	 ('1002051','1000102','莲花北营销服务中心（其他）',5),
	 ('1002050','1000102','竹子林营销服务中心（其他）',5),
	 ('1002061','1000102','益田营销服务中心（其他）',5),
	 ('1002071','1000102','南园营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002072','1000103','龙井营销服务中心（其他）',5),
	 ('3000020965','1000103','粤海营销服务中心（其他）',5),
	 ('1002060','1000103','沙河营销服务中心（其他）',5),
	 ('1000092','755000000','政企客户部',4),
	 ('100057053','755000000','安全保卫部（后勤服务中心）',4),
	 ('1001408','755000000','客户服务部',4),
	 ('1002890','755000000','网络部（网信安部）',4),
	 ('1002895','755000000','销售部',4),
	 ('1989902','755000000','财务部',4),
	 ('1990022','755000000','人力资源部（企业管理部）',4);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940334180','755000000','党委办公室（综合办公室、乡村振兴办、党群工作部）',4),
	 ('1001082','1001408','服务管理团队',5),
	 ('100202219','1000092','业务管理团队',5),
	 ('100202220','1000092','部门领导',5),
	 ('100217270','100057053','综合管理团队',5),
	 ('100275229','1000092','综合经营团队',5),
	 ('100275230','1000092','基础业务经营团队',5),
	 ('100275231','1000092','渠道运营团队',5),
	 ('100275233','1000092','跨域业务经营团队',5),
	 ('100301338','100057053','房产服务团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1152740','1000092','跨域业务经营团队',5),
	 ('1168175','1002890','规划创新团队',5),
	 ('1178370','1002890','综合运营团队',5),
	 ('1195504','100057053','枢纽大厦管家团队',5),
	 ('1625004337','1002895','客户经营支撑团队',5),
	 ('214152','1002895','客户研究团队',5),
	 ('214154','1002890','核心网络维护团队',5),
	 ('214155','1989902','税务管理团队',5),
	 ('3000062062','1002890','基础网络团队',5),
	 ('3000062063','1002890','交付服务团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('769000182','1002895','产品业务管理团队',5),
	 ('940333466','100057053','行政外联团队',5),
	 ('940333565','1989902','风险管理团队',5),
	 ('940333573','940334180','宣传新闻团队（记者站）',5),
	 ('940333574','1990022','薪酬福利团队',5),
	 ('940333575','1990022','培训发展团队',5),
	 ('1168258','1168170','运营支撑团队',5),
	 ('940277292','1001130','光明工业互联网行业团队',5),
	 ('3000070128','1209663','创新中心-综合管理团队',5),
	 ('3000071083','1000102','沙头商厦营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000071102','1000102','河套商厦营销服务中心',5),
	 ('3000071103','1000102','益田主流社区营销服务中心',5),
	 ('3000071104','1000103','北部城中村营销服务中心',5),
	 ('3000071105','1000102','黄木岗主流社区营销服务中心',5),
	 ('3000071106','1000102','竹子林主流社区营销服务中心',5),
	 ('3000071107','1000102','黄木岗商厦营销服务中心',5),
	 ('3000071108','1000103','南油商厦营销服务中心',5),
	 ('3000071109','1000102','沙头城中村营销服务中心',5),
	 ('3000071110','1000103','南油主流社区营销服务中心',5),
	 ('3000071111','1000102','皇岗城中村营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000071112','1000103','西丽龙井主流社区营销服务中心',5),
	 ('3000071113','1000102','益田商厦营销服务中心',5),
	 ('3000071114','1000102','香蜜湖商厦营销服务中心',5),
	 ('3000071115','1000103','高新沙河商厦营销服务中心',5),
	 ('3000071116','1000103','高新沙河主流社区营销服务中心',5),
	 ('3000071117','1000103','粤海南头主流社区营销服务中心',5),
	 ('3000071118','1000103','西丽龙井商厦营销服务中心',5),
	 ('3000071119','1000102','梅林主流社区营销服务中心',5),
	 ('3000071120','1000102','莲花北主流社区营销服务中心',5),
	 ('3000071122','1000103','粤海南头商厦营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000071123','1000103','南部城中村营销服务中心',5),
	 ('3000066518','940254959','动力维护团队',5),
	 ('3000071124','1000102','皇岗南园商厦营销服务中心',5),
	 ('3000071125','1000102','莲花梅林商厦营销服务中心',5),
	 ('3000071285','1000101','城中村营销服务中心',5),
	 ('3000071286','1000101','罗湖西主流社区营销服务中心',5),
	 ('3000071288','1000101','罗湖东主流社区营销服务中心',5),
	 ('3000071289','1000101','罗湖西商厦园区营销服务中心',5),
	 ('3000071290','1000101','罗湖东商厦园区营销服务中心',5),
	 ('3000072357','1226945','城中村深汕南营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000072358','1226945','主流社区/商铺营销服务中心',5),
	 ('3000072359','1226945','城中村深汕北营销服务中心',5),
	 ('3000073387','1000501','光明北商厦园区营销服务中心',5),
	 ('3000073389','1000501','光明南商厦园区营销服务中心',5),
	 ('3000073390','1000501','光明北城中村营销服务中心',5),
	 ('3000073393','1000501','光明南城中村营销服务中心',5),
	 ('3000073396','1000501','主流社区营销服务中心',5),
	 ('3000077142','100317074','民治主流社区营销服务中心',5),
	 ('3000077143','100317074','大浪商厦园区营销服务中心',5),
	 ('3000077144','100317074','民治商厦园区营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000077145','100317074','观澜城中村营销服务中心',5),
	 ('3000077147','100317074','龙华商厦园区营销服务中心',5),
	 ('3000077148','100317074','龙华主流社区营销服务中心',5),
	 ('3000077149','100317074','大浪城中村营销服务中心',5),
	 ('3000077151','100317074','观澜商厦园区营销服务中心',5),
	 ('769000185','1002895','营销策划团队',5),
	 ('940246352','100057053','重点机楼管家团队',5),
	 ('940247004','100057053','公寓交通服务团队',5),
	 ('940303811','1000092','客户经营团队',6),
	 ('940332521','100057053','党委文秘团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940332610','1989902','预算管理团队',5),
	 ('940332611','1989902','会计核算团队',5),
	 ('940332612','1989902','资产价值运营团队',5),
	 ('940332618','940334180','党建党廉团队',5),
	 ('940332619','1990022','员工及领导力发展团队',5),
	 ('940332620','1990022','人才建设及服务团队',5),
	 ('940332682','1002890','综合维护管理团队',5),
	 ('940332683','1002890','无线网络团队',5),
	 ('940332684','1002890','装维管理团队',5),
	 ('940332690','1001408','政企服务赋能团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940332705','1002895','综合经营团队',5),
	 ('940332706','1002895','综合网格运营团队',5),
	 ('940332707','1002895','互联互通团队',5),
	 ('940333465','100057053','安全生产团队',5),
	 ('3000077612','940254959','管线代维团队',5),
	 ('3000077730','1000104','盐田中部主流营销服务中心',5),
	 ('3000077731','1000305','西部城中村营销服务中心',5),
	 ('3000077732','1000104','盐田西部主流营销服务中心',5),
	 ('3000077733','1000305','中部商厦园区营销服务中心',5),
	 ('3000077734','100319499','商厦/园区营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000077735','1000305','西部商厦园区营销服务中心',5),
	 ('3000077736','1000305','东部城中村营销服务中心',5),
	 ('3000077737','1000104','盐田东部主流营销服务中心',5),
	 ('3000077739','1000305','中部城中村营销服务中心',5),
	 ('3000077740','1000305','东部主流社区营销服务中心',5),
	 ('3000077743','1000104','盐田城中村营销服务中心',5),
	 ('3000077745','1000305','东部商厦园区营销服务中心',5),
	 ('3000077746','100319499','主流社区营销服务中心',5),
	 ('940333576','1990022','人力规划团队',5),
	 ('940333631','1002890','基础网络能力团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940333632','1002890','云网平台团队',5),
	 ('940333633','1002890','承载网络团队',5),
	 ('940333634','1002890','云网安支撑团队',5),
	 ('940333639','1001408','服务监督团队',5),
	 ('940333648','1002895','业务稽核团队',5),
	 ('940334067','100057053','档案保密团队',5),
	 ('940334068','100057053','安全保卫团队',5),
	 ('940334168','1989902','业务价值支撑团队',5),
	 ('940334182','940334180','群团文化团队',5),
	 ('940334183','940334180','党建党廉团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940334184','940334180','党委文秘团队',5),
	 ('940334284','1002890','网络安全团队',5),
	 ('940334310','1002895','渠道管理团队',5),
	 ('3000069989','1000092','南山卫健教育政企直销',5),
	 ('3000070244','1000092','产数业务经营团队',5),
	 ('3000070245','1000092','PMO管理团队',5),
	 ('1990267','755000000','企业管理部（综合服务支撑中心）',4),
	 ('940210776','755000000','市分公司本部',4),
	 ('940254959','755000000','综合维护中心',4),
	 ('940304496','755000000','能力中心（5G应用联合创新中心）',4);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000066976','1000091','新媒体运营团队',5),
	 ('227087','1000091','电商合作团队',5),
	 ('940120099','1000091','数字化支撑团队',5),
	 ('940333679','3000066955','中小生态团队',6),
	 ('1001132','1000091','渠道运营支撑团队',5),
	 ('1124348','1000091','客户经营团队',5),
	 ('1001134','3000066955','跨界拓展团队',6),
	 ('1178355','1000091','渠道运营团队',5),
	 ('1001210','1000091','综合管理团队',5),
	 ('1178376','1000091','数字化运营团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002038','1000101','文华营销服务中心（其他）',5),
	 ('1002040','1000101','泥岗营销服务中心（其他）',5),
	 ('1002041','1000101','红宝营销服务中心（其他）',5),
	 ('1002042','1000101','商业城营销服务中心（其他）',5),
	 ('1002100','1000101','罗湖营销服务中心（其他）',5),
	 ('1002059','1000103','西丽营销服务中心（其他）',5),
	 ('1002058','1000103','南头营销服务中心（其他）',5),
	 ('1002057','1000103','南油营销服务中心（其他）',5),
	 ('1002056','1000103','高新区营销服务中心（其他）',5),
	 ('1002044','1000104','沙头角营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002043','1000104','东湖营销服务中心（其他）',5),
	 ('1002069','1000104','莲塘营销服务中心（其他）',5),
	 ('1002077','1000104','盐田港营销服务中心（其他）',5),
	 ('755000000','500001','深圳分公司',3),
	 ('1000091','755000000','数字化营销中心',4),
	 ('1000101','755000000','罗湖分公司',4),
	 ('1000102','755000000','福田分公司',4),
	 ('1000103','755000000','南山分公司',4),
	 ('1000104','755000000','盐田分公司',4),
	 ('1000201','755000000','蛇口分公司(区县其它)',4);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1000305','755000000','龙岗分公司',4),
	 ('1000401','755000000','宝安分公司',4),
	 ('1000501','755000000','光明分公司',4),
	 ('1001054','755000000','IT运营中心/人工智能应用中心',4),
	 ('1001130','755000000','政企客户中心',4),
	 ('1001409','755000000','10000号深圳区域中心',4),
	 ('100265604','755000000','客响建设中心',4),
	 ('1002892','755000000','客户服务调度与资源中心',4),
	 ('100306121','755000000','采购供应中心',4),
	 ('100317074','755000000','龙华分公司',4);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('100317169','755000000','商业客户拓展中心',4),
	 ('100319494','755000000','坪山大鹏分公司',4),
	 ('100319499','755000000','前海自贸区分公司',4),
	 ('100323659','755000000','解决方案中心',4),
	 ('100323671','755000000','网络操作维护中心',4),
	 ('1168170','755000000','无线网络运营中心',4),
	 ('1209663','755000000','创新业务运营中心（号百信息服务中心）',4),
	 ('1226945','755000000','深汕特别合作区分公司',4),
	 ('1990011','755000000','云中台/云网安交付运营中心',4),
	 ('1002012','1000305','布吉营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002001','1000305','龙岗营销服务中心（其他）',5),
	 ('1002003','1000305','坪地营销服务中心（其他）',5),
	 ('1002010','1000305','横岗营销服务中心（其他）',5),
	 ('1002015','1000305','坂田营销服务中心（其他）',5),
	 ('1002016','1000305','南湾营销服务中心（其他）',5),
	 ('1002018','1000305','平湖营销服务中心（其他）',5),
	 ('1002022','1000305','龙城营销服务中心（其他）',5),
	 ('3000077747','1000305','中部主流社区营销服务中心',5),
	 ('3000077749','1000305','西部主流社区营销服务中心',5),
	 ('3000082148','100319494','龙田城中村营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000082149','100319494','石井城中村营销服务中心',5),
	 ('3000082150','100319494','大鹏城中村营销服务中心',5),
	 ('3000082151','100319494','南澳城中村营销服务中心',5),
	 ('3000082152','100319494','坑梓城中村营销服务中心',5),
	 ('3000082153','100319494','马峦城中村营销服务中心',5),
	 ('3000082241','100319494','葵涌城中村营销服务中心',5),
	 ('3000082242','100319494','坪山主流社区营销服务中心',5),
	 ('3000084539','100317169','专业市场运营团队',5),
	 ('3000090544','1000401','裕安城中村场景营销服务中心',5),
	 ('3000090545','1000401','新安主流社区场景营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000090546','1000401','西乡商厦园区场景营销服务中心',5),
	 ('3000090547','1000401','福永商厦园区场景营销服务中心',5),
	 ('3000090548','1000401','沙井商厦园区场景营销服务中心',5),
	 ('3000090549','1000401','西乡城中村场景营销服务中心',5),
	 ('3000090550','1000401','机场城中村场景营销服务中心',5),
	 ('3000090551','1000401','新安商厦园区场景营销服务中心',5),
	 ('3000090552','1000401','固戍商厦园区场景营销服务中心',5),
	 ('3000090553','1000401','松岗商厦园区场景营销服务中心',5),
	 ('3000090554','1000401','石岩城中村场景营销服务中心',5),
	 ('3000090555','1000401','松岗城中村场景营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000090556','1000401','沙井城中村场景营销服务中心',5),
	 ('3000090557','1000401','西乡主流社区场景营销服务中心',5),
	 ('3000090558','1000401','机场主流社区场景营销服务中心',5),
	 ('3000090559','1000401','福永主流社区场景营销服务中心',5),
	 ('3000090560','1000401','机场商厦园区场景营销服务中心',5),
	 ('3000090561','1000401','新桥商厦园区场景营销服务中心',5),
	 ('3000090562','1000401','新桥主流社区场景营销服务中心',5),
	 ('3000090563','1000401','固戍主流社区场景营销服务中心',5),
	 ('3000090564','1000401','福永城中村场景营销服务中心',5),
	 ('3000090565','1000401','石岩主流社区场景营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000090566','1000401','松岗主流社区场景营销服务中心',5),
	 ('3000090567','1000401','新桥城中村场景营销服务中心',5),
	 ('3000090568','1000401','裕安商厦园区场景营销服务中心',5),
	 ('3000090569','1000401','福海商厦园区场景营销服务中心',5),
	 ('3000090570','1000401','固戍城中村场景营销服务中心',5),
	 ('3000090571','1000401','福海城中村场景营销服务中心',5),
	 ('3000090572','1000401','沙井主流社区场景营销服务中心',5),
	 ('3000090573','1000401','福海主流社区场景营销服务中心',5),
	 ('3000090574','1000401','石岩商厦园区场景营销服务中心',5),
	 ('3000090576','1000401','裕安主流社区场景营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000099382','1000401','航城石岩城中村营销服务中心',5),
	 ('3000099386','1000401','会展新桥商厦园区营销服务中心',5),
	 ('3000099387','1000401','宝中商厦园区营销服务中心',5),
	 ('3000099388','1000401','航城石岩商厦园区营销服务中心',5),
	 ('3000099389','1000401','沙井松岗城中村营销服务中心',5),
	 ('3000099391','1000401','宝中城中村营销服务中心',5),
	 ('3000099392','1000401','会展新桥城中村营销服务中心',5),
	 ('3000099395','1000401','航城石岩主流社区营销服务中心',5),
	 ('3000099399','1000401','沙井松岗商厦园区营销服务中心',5),
	 ('3000099400','1000401','宝中主流社区营销服务中心',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000099402','1000401','沙井松岗主流社区营销服务中心',5),
	 ('3000099404','1000401','会展新桥主流社区营销服务中心',5),
	 ('3000088155','1000092','23年南山政企互联网3行业团队',5),
	 ('3000090606','1000092','宝安政务政法公安行业团队',5),
	 ('3000090616','1000092','前海金融交通物流智慧城建行业团队',5),
	 ('3000090618','1000092','南山西丽龙井商厦西丽行业团队',5),
	 ('3000090619','1000092','前海工业互联网卫健教育行业团队',5),
	 ('3000090620','1000092','深汕工业文旅商客智慧城建行业团队',5),
	 ('3000090621','1000092','盐田文旅商客行业团队',5),
	 ('1002102','1000401','固戍营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002031','1000401','石岩营销服务中心（其他）',5),
	 ('1002026','1000401','机场营销服务中心（其他）',5),
	 ('1002025','1000401','西乡营销服务中心（其他）',5),
	 ('1002024','1000401','裕安营销服务中心（其他）',5),
	 ('1002023','1000401','新安营销服务中心（其他）',5),
	 ('940356719','1000401','福海营销服务中心（其他）',5),
	 ('1002101','1000401','福永营销服务中心（其他）',5),
	 ('1002029','1000401','松岗营销服务中心（其他）',5),
	 ('1002028','1000401','沙井营销服务中心（其他）',5),
	 ('1002027','1000401','新桥营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002030','1000501','公明营销服务中心（其他）',5),
	 ('3000014737','1000501','凤凰营销服务中心（其他）',5),
	 ('3000014738','1000501','新湖营销服务中心（其他）',5),
	 ('1002103','1000501','光明营销服务中心（其他）',5),
	 ('1002104','1000501','玉塘营销服务中心（其他）',5),
	 ('3000014736','1000501','马田营销服务中心（其他）',5),
	 ('1161873','1001054','应用开发团队',5),
	 ('1161874','1001054','计费结算团队',5),
	 ('1161875','1001054','产品支撑团队',5),
	 ('1162345','1001054','IT服务团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940272337','1001054','系统支撑团队',5),
	 ('940271349','1001054','订单支撑团队',5),
	 ('1186030','1001054','政企支撑团队',5),
	 ('940271348','1001054','客户资料团队',5),
	 ('1990407','1001054','营收管理团队',5),
	 ('216109','1001054','账务管理团队',5),
	 ('3000029827','1001130','市本部商客酒店餐饮行业团队',5),
	 ('3000029731','1001130','商业客户中心商贸服务行业团队',5),
	 ('3000029736','1001130','商业客户中心酒店餐饮行业团队',5),
	 ('3000029737','1001130','市本部教育行业团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000061354','1001130','龙岗西部政务政企直销',5),
	 ('940294529','1001130','市本部卫健教育行业团队',5),
	 ('3000030366','1001130','卫建行业团队',5),
	 ('3000062720','1001130','南山南油商厦海德政企直销',5),
	 ('3000061971','1001130','蛇口政企交通物流行业团队',5),
	 ('3000062583','1001130','南山互联网政企直销1',5),
	 ('3000062588','1001130','23年南山政企卫健教育行业团队（无效机构）',5),
	 ('3000062592','1001130','南山政务政企直销',5),
	 ('3000062599','1001130','南山政法公安智慧城建政企直销',5),
	 ('3000030082','1001130','蛇口政企政务商业行业团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940335677','1129912','前海政务政法公安文旅商客行业团队',6),
	 ('3000062600','1001130','南山金融交通物流政企直销',5),
	 ('1215097','1001130','盐田政企客户中心校园团队',5),
	 ('1217456','1001130','光明政务行业团队',5),
	 ('3000062601','1001130','南山文旅商客政企直销',5),
	 ('940337687','1001130','市本部商业客户中心服务行业团队',5),
	 ('940258738','1001130','前海自贸区校园团队',5),
	 ('940257894','1001130','前海政企客户中心校园团队',5),
	 ('3000062603','1001130','南山工业政企直销',5),
	 ('216108','1001130','合作拓展团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('3000062607','1001130','南山互联网政企直销2',5),
	 ('940339207','1001130','市本部商业客户中心商贸行业团队',5),
	 ('940343650','1001130','卫健团队',5),
	 ('3000012439','1001130','光明方案解决中心项目团队',5),
	 ('3000029741','1001130','市本部卫健行业团队',5),
	 ('3000030078','1001130','蛇口政企交通住建工业行业团队',5),
	 ('3000029828','1001130','市本部商客商贸服务行业团队',5),
	 ('3000064661','1001130','23年蛇口政企交通物流行业团队',5),
	 ('3000064605','1001130','23年蛇口政企工业互联行业团队',5),
	 ('1001086','1001409','视频会视维护团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940332628','1168170','无线建设团队',5),
	 ('940332627','100265604','接入网络团队',5),
	 ('940332626','100265604','工程造价管理团队',5),
	 ('940332625','100265604','工程统筹管理团队',5),
	 ('940333580','100265604','云网新基建团队',5),
	 ('100003028','1002892','装维服务团队',5),
	 ('100003032','1002892','装维交付团队',5),
	 ('100003033','1002892','带宽型业务交付团队',5),
	 ('3000057860','1002892','智能调度运营团队',5),
	 ('940333622','1002892','云网资源管理团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940332673','1002892','基础资源管理团队',5),
	 ('100003031','1002892','装维支撑团队',5),
	 ('940334190','100306121','服务采购团队',5),
	 ('100306122','100306121','物流及库存管理团队',5),
	 ('940333578','100306121','采购管理团队',5),
	 ('940333579','100306121','物资采购团队',5),
	 ('1002034','100317074','民治营销服务中心（其他）',5),
	 ('1002032','100317074','龙华营销服务中心（其他）',5),
	 ('100317075','100317074','大浪营销服务中心（其他）',5),
	 ('1002033','100317074','观澜营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1152654','100317074','观湖营销服务中心（其他）',5),
	 ('940322860','100317169','园区运营团队',5),
	 ('3000028371','100317169','商业客户中心酒店餐饮行业团队',5),
	 ('3000028372','100317169','商业客户中心商贸服务行业团队',5),
	 ('940322861','100317169','商客新兴领域经营团队',5),
	 ('940324689','100317169','商厦运营团队',5),
	 ('1002005','100319494','坑梓营销服务中心（其他）',5),
	 ('940262058','100319494','石井营销服务中心（其他）',5),
	 ('940261090','100319494','马峦营销服务中心（其他）',5),
	 ('1002004','100319494','坪山营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1002020','100319494','大鹏营销服务中心（其他）',5),
	 ('228303','100319494','葵涌营销服务中心（其他）',5),
	 ('3000020964','100319499','桂湾营销服务中心（其他）',5),
	 ('100323673','100323671','客户网络监控团队',5),
	 ('100323672','100323671','综合服务支撑团队',5),
	 ('100323678','100323671','数据网络维护团队',5),
	 ('100323674','100323671','云业务交付运营团队',5),
	 ('100323675','100323671','IT及云业务支撑团队',5),
	 ('100323676','100323671','核心网络维护团队',5),
	 ('100323677','100323671','承载网络维护团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('100323680','100323671','网络安全维护团队',5),
	 ('940332633','1168170','无线规划团队',5),
	 ('1168259','1168170','无线优化团队',5),
	 ('1168171','1168170','客户服务团队',5),
	 ('100000307','1209663','信息安全支撑团队',5),
	 ('100202160','3000051634','信息服务运营团队',6),
	 ('100202161','1209663','客户经营支撑团队',5),
	 ('100202163','3000051634','互联网金融运营团队',6),
	 ('940295364','1209663','全屋智能承包团队',5),
	 ('1232346','1226945','鲘门营销服务中心（其他）',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('1232345','1226945','赤石营销服务中心（其他）',5),
	 ('1232347','1226945','小漠营销服务中心（其他）',5),
	 ('1232342','1226945','鹅埠营销服务中心（其他）',5),
	 ('100323663','1990011','运营统筹团队',5),
	 ('100323666','100323671','政企平台维护团队',5),
	 ('1135274','1002892','政企服务响应团队',5),
	 ('940332564','1990267','战略绩效团队',5),
	 ('940332567','1990267','机构流程团队',5),
	 ('940332568','1001054','信息化管理团队',5),
	 ('3000066422','3000092963','运营优化团队',6);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940255918','940254959','备品备件团队',5),
	 ('940254962','1168170','基站业务团队',5),
	 ('940254961','940254959','IDC西部现场维护团队',5),
	 ('940254960','940254959','管线支撑团队',5),
	 ('940256885','940254959','西部干线维护团队',5),
	 ('940256884','940254959','客网运营支撑团队',5),
	 ('940256883','940254959','客网运营团队',5),
	 ('940256882','940254959','IDC东部现场维护团队',5),
	 ('940256881','940254959','技术业务团队',5),
	 ('940256880','940254959','综合及财务支撑团队',5);
INSERT INTO app_organizations (id,parentid,"name","level") VALUES
	 ('940255922','940254959','东部干线维护团队',5),
	 ('940255920','940254959','长途维护团队',5),
	 ('940255919','1168170','无线维护团队',5),
	 ('940306306','940304496','云网能力团队',5),
	 ('940306305','940304496','DICT产品团队',5),
	 ('940306307','100323659','物联网视联网部',5),
	 ('940306308','100323659','安全信创卫星5G部',5);
	
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('300dd782-2df3-4658-81f3-010b25bd52a7','图形化管理-全市','基础功能，权限为全市',1),
	 ('0240615c-281f-a3e7-9921-d5f6332900f8','管道租赁租入角色','管道租赁租入角色',NULL),
	 ('8c5a8395-19fb-8ac1-64f8-2683ab517e0c','管道租赁租出角色','管道租赁租出角色',NULL),
	 ('adf4210c-a253-4d04-b683-9d42959fe37c','机房空间管理','机房空间管理',1),
	 ('8327a88b-5ab2-4e3d-b084-4fb2cf78817a','带宽评估','带宽评估模块角色,用于开通带宽评估模块权限',1),
	 ('100240','合同后补功能角色','合同后补功能角色',NULL),
	 ('100080','深圳无线组','深圳无线组角色',NULL),
	 ('zwfw','装维服务团队','装维服务团队角色',1),
	 ('task','需求平台角色','需求平台角色',1),
	 ('znddyy_sjl','智能调度运营团队经理','智能调度运营团队经理',1);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('qtgjjk','告警监控','',1),
	 ('sbs_sjl','设备室室经理','设备室室经理',1),
	 ('e966883d-912c-450f-a95c-5f59df365571','图形化_系统管理员','原“基准网格用户权限”',1),
	 ('33d256f9-0f05-4e39-85d1-ecc86b84616a','自有资产查询角色','自有资产普通用户',1),
	 ('d5fc7d53-ada2-44da-87c7-b79f3e47fdcb','自有资产_系统管理员','自有资产市公司管理员',1),
	 ('71c8d9b3-9cd8-4e3c-9d28-86a6ba96bf31','图形化管理基础查看角色','原“图形化管理基础查看角色 ”可删除，无精准两达图权限',1),
	 ('350c247c-f97b-4b12-96fd-e503af51f82b','无线室分系统基础角色','无线室分系统基础角色',1),
	 ('52a36ac7-0527-4969-b296-f241b0fd3d6a','室分规划立项库整表导出角色','室分规划立项库整表导出角色',1),
	 ('d8170473-91a5-4dc1-ae31-c7ec2eef052f','派单策略','派单策略模块角色，用于开通派单策略模块权限',1),
	 ('c4425456-0d21-4753-9505-2641f8df50f8','基础权限-区分','ACC流程未说明具体权限需求的区分级人员',1);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('e0e5b93a-115b-4148-b80a-0f77eea817a6','基础查看-营服','对于ACC上单未说明具体权限的营服级别人员提供的基础权限',1),
	 ('51d80008-3a42-4f3c-9084-1b57bf5b960d','无线室分管理角色','无线室分管理角色',1),
	 ('zwfw_sjl','装维服务团队经理','装维服务团队经理',1),
	 ('4302','所有流程起单人角色','所有流程起单人角色',NULL),
	 ('4303','回单角色','没有起单权限',NULL),
	 ('4702','零散起单人角色','零散起单人角色',NULL),
	 ('100100','右键菜单角色','临时添加右键菜单角色',NULL),
	 ('5262','逼迁流程起单角色','逼迁流程起单角色',NULL),
	 ('5263','逼迁流程回单角色','逼迁流程回单角色',NULL),
	 ('100360','能耗角色:电表维护员','能耗角色:电表维护员(7、9、10)',NULL);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('100361','能耗角色:主管、报账','能耗角色:主管、报账(8、10)',NULL),
	 ('100340','能耗全功能角色','能耗全功能角色(7、8、9、10)',NULL),
	 ('100341','能耗查询角色','能耗查询角色(10)',NULL),
	 ('gxs_sjl','管线室室经理','管线室室经理',1),
	 ('downhelper','下载助手','下载助手',1),
	 ('zwzc','装维支撑团队','装维支撑团队角色',1),
	 ('znddyy','智能调度运营团队','智能调度运营团队',1),
	 ('1546270084566138881','设备室','sbs',NULL),
	 ('1548506333879922689','调度室','dds',NULL),
	 ('1548506385964789761','管线室','gxs',NULL);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('7a30aedd-ffd2-40bd-88de-f97ea15822af','默认视图角色','默认视图角色',1),
	 ('1dbd51a4-7b96-467f-8329-028e0627c913','房屋管理员','自有资产房屋管理员',1),
	 ('6542','无线地标角色','无线地标角色',NULL),
	 ('5742','合同凭证审批流程','合同凭证审批流程',NULL),
	 ('6782','电表管理角色','电表管理角色',NULL),
	 ('6783','新建电表管理角色','新建电表管理角色',NULL),
	 ('5022','无线起单','无线起单',NULL),
	 ('5023','无线回单','无线回单',NULL),
	 ('5024','立项表上传','立项表上传',NULL),
	 ('6142','站址参数调整','站址参数调整流程',NULL);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('6222','站址参数调整流程','站址参数调整流程',NULL),
	 ('5102','无资源待装','无资源待装',NULL),
	 ('5582','无资源待装操作人员','无资源待装操作人员',NULL),
	 ('6302','政企专线角色','政企专线角色',NULL),
	 ('5182','设备资源补充流程角色','设备资源补充流程角色',NULL),
	 ('5422','无线室外站起单角色','无线室外站起单角色',NULL),
	 ('5423','无线室外站回单角色','无线室外站回单角色',NULL),
	 ('5502','光驻地网资源补充','光驻地网资源补充起单角色',NULL),
	 ('5822','国标流程起单角色','国标流程起单角色',NULL),
	 ('5823','国标流程回单角色','国标流程回单角色',NULL);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('5902','基础角色','基础角色',NULL),
	 ('5982','逼迁流程报表','逼迁流程报表',NULL),
	 ('6062','OBD预警清单','OBD预警清单',NULL),
	 ('6382','系统管理员角色','系统管理员角色',NULL),
	 ('6462','室分管理员角色','室分管理员角色',NULL),
	 ('6622','政企专线待办','政企专线待办',NULL),
	 ('6862','室分系统导出整个库角色','室分系统专用角色',NULL),
	 ('6942','无线设计岗','室分系统专用角色',NULL),
	 ('6944','区分无线岗','室分系统专用角色',NULL),
	 ('7022','楼盘打标角色','楼盘打标角色',NULL);
INSERT INTO app_roles (id,"name",remark,status) VALUES
	 ('7102','导出清单审批菜单权限','导出清单审批菜单权限',NULL),
	 ('7103','数据导入角色','数据导入角色',NULL),
	 ('dds_sjl','调度室室经理','调度室室经理',1),
	 ('zwzc_sjl','装维支撑团队经理','装维支撑团队经理',1),
	 ('7c6465bf-7d8d-4e66-8450-a6281be561d2','两达图角色','两达图角色',1),
	 ('100460','图形化管理','新增图形化管理角色，将原来深圳市、区分、营服的角色挂过去',1);
	
	
	
insert into user_login ( user_name, "password") values ('admin2','8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918');

insert into roles ( role_name, remark, status) values ( '管理员2', 'admin2', 1);

insert into user_role ( user_id ,role_id)
select mu.id, r.id from user_login mu, roles r;

insert into role_menu (role_id, menu_id)
select r.id ,r2.id  from roles r, menus r2 ;

-----------------------------------------------------------------
select * from menus m ;
delete from menus ;
select * from sys_log sl order by create_time desc;

select * from user_login ul ;

select * from roles;

select id, name from app_organizations o order by "level" ;
select * from app_roles ;

--59ecbb85-78c9-19a4-7ae0-ca21464d21ec, 8327a88b-5ab2-4e3d-b084-4fb2cf78817a
select * from user_app_roles;

insert into user_app_roles (user_id, app_roles_id) values ('59ecbb85-78c9-19a4-7ae0-ca21464d21ec', '8327a88b-5ab2-4e3d-b084-4fb2cf78817a');

select
    ul.user_name userName,
    ul.name,
    (select name from app_organizations o  where o.id = ul.app_organization_id) organizationName,
    ul.create_time createTime,
    ul.account_type_id accountTypeName,
    ul.permission_type_id permissionTypeName,
    ul.status,
    (select string_agg(ap.name, ',') from app_roles ap ,user_app_roles uap where ap.id = uap.app_roles_id and uap.user_id = ul.id) appRolesName,
    '' appsName
from user_login ul;

select * from app_organizations;
select id, name from app_roles ;



